---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewCleanJoins
source: html/325daefc-3046-2da8-11f1-ce4d73ec5976.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewCleanJoins Property

"Wall Join Display"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewCleanJoins { get; }
```